2022-04-27-wordpress-en-docker.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://martiyo.github.io/rss.xml"
      title="RSS feed for https://martiyo.github.io/"
    />
    <title>Wordpress en docker</title>
    <meta name="author" content="martiyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico" />
  </head>
  <body>
    <div id="preamble" class="status">
      <div class="header">
        <ul>
          <li><a href="https://martiyo.github.io/">/home</a></li>
          <li><a href="https://martiyo.github.io/about">/about</a></li>
          <li><a href="https://martiyo.github.io/contact">/contact</a></li>
        </ul>
        <h1>El universo perdido de GNU/Emacs</h1>
        <blockquote>
          Este blog es una farsa son solo resumenes, traducciónes y cosas que
          encuentro por ahí.
        </blockquote>
        <form>
          <input type="text" placeholder="Search..." />
        </form>
        <br />
      </div>
    </div>
    <div id="content">
      <div class="post-date">27 abr 2022</div>
      <h1 class="post-title">
        <a href="https://martiyo.github.io/2022-04-27-wordpress-en-docker.html"
          >Wordpress en docker</a
        >
      </h1>

      <div id="outline-container-org0edbb6a" class="outline-2">
        <h2 id="org0edbb6a">Docker-compose</h2>
        <div class="outline-text-2" id="text-org0edbb6a">
          <p>
            Docker Compose es una herramienta que permite definir y ejecutar
            aplicaciones Docker empleando varios contenedores. Compose usa un
            fichero de texto con la extensión yaml en el que se guarda la
            configuración de los servicios(imagenes), redes y volúmenes para
            persistencia de datos que requieran las aplicaciones
            <a href="https://www.arsys.es/blog/wordpress-contenedordocker"
              >https://www.arsys.es/blog/wordpress-contenedordocker</a
            >
          </p>

          <p>
            <a
              href="https://forums.docker.com/t/how-to-get-access-to-php-ini-file/68986/2"
              >https://forums.docker.com/t/how-to-get-access-to-php-ini-file/68986/2</a
            >
          </p>
        </div>
      </div>
      <div class="taglist">
        <a href="https://martiyo.github.io/tags.html">Tags</a>:
        <a href="https://martiyo.github.io/tag-docker.html">docker</a>
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="archive">
        <a href="https://martiyo.github.io/archive.html">Other posts</a>
      </div>
      <footer></footer>
    </div>
  </body>
</html>
